
# POSTMAN 설치
http://postman.com

# HTTP 1.1에 대해서 배워보기
통신 : 두개의 대상에 스트림이 연결이 되어야 한다. ( Byte Stream[8Bit] )

데이터를 보낼 때 : Write 하겠다. >>  ( 요청 Request  )
데이터를 받을 때 : Read 하겠다.  <<  ( 응답 Response )


# HTTP 통신 : 약속이 필요!
HTTP 1.1 기준 : 통신의 방법 4가지

# 요청(Request)의 방법 4가지
첫 번째 방법 : GET      : 데이터를 줘!         ( SELECT ) 조회;
              요청 뒤에?를해서 어떤 데이터를 달라는지 설정할 수 있다.

두 번째 방법 : POST     : 데이터를 추가해줘    ( INSERT ) 저장;
              요청 뒤에?를해서 어떤 데이터를 달라는지 설정할 수 있다.

세 번째 방법 : PUT      : 데이터를 수정해줘    ( UPDATE ) 수정;
              요청 뒤에?를해서 어떤 데이터를 달라는지 설정할 수 있다.

네 번째 방법 : DELETE   : 데이터를 삭제해줘    ( DELETE ) 삭제;
              요청 뒤에?를해서 어떤 데이터를 달라는지 설정할 수 있다.

# 클라이언트 :
요청을 하는 자!

# 서버 :
응답을 주는 자!